Repository: ubtue/validation-service-web-app
Catalog: ng-validation-service/src/localization/messages.*.xlf
Languages: de

# validationServiceMenuTitle
source: Validation Service
de: Validierungsdienst

# batchesMenuTitle
source: Batches
de: Stapel

# reportsMenuTitle
source: Reports
de: Berichte

# configurationsMenuTitle
source: Configurations
de: Konfigurationen

# settingsMenuTitle
source: Settings
de: Einstellungen

# usersMenuTitle
source: Users
de: Benutzer

# loginMenuTitle
source: Login
de: Anmelden

# logoutMenuTitle
source: Logout
de: Abmelden

# addBatchButton
source: Batch
de: Stapel

# batchNameSearchPlaceholder
source: Search name
de: Name suchen

# columnHeaderBatchName
source: Batch Name
de: Stapelname

# columnHeaderBatchCreationDate
source: Creation Date
de: Erstellt

# deleteBatchButton
source: Delete
de: Löschen

source: {VAR_PLURAL, plural, =0 {No Batches} =1 {One Batch} other {{{this.page.totalCount}} Batches} }
de: {VAR_PLURAL, plural, =0 {Keine Stapel} =1 {Ein Stapel} other {{{this.page.totalCount}} Stapel} }

# sectionFileUpload
source: File Upload
de: Dateiupload

# sectionFileManager
source: Files
de: Dateien

# sectionReportSubmission
source: Reports
de: Berichte

# uploaderFileSize
source: Size
de: Größe

# removeUploadButtonLabel
source: Remove
de: Löschen

# headerUploadsInProgress
source: Upload in progress ...
de: Uploadvorgang läuft ...

# legendCreateBatch
source: Create Batch
de: Stapel erstellen

# labelBatchName
source: Batch name
de: Stapelname

# batchNameHint
source: A short description of the material that will be uploaded for validation
de: Eine kurze Beschreibung des Materials, das hochgeladen wird

# batchNameMissingMessage
source: Please enter a name
de: Bitte Namen eingeben

# buttonAbortBatchCreation
source: Abort
de: Abbrechen

# buttonCreateBatch
source: Create
de: Erstellen

# placeholderFileName
source: Search name ...
de: Name suchen ...

# fileSizeDescription
source: size
de: Größe

# fileUploadedOnDescription
source: Uploaded on
de: Hochgeladen am

# buttonDeleteFile
source: Delete
de: Löschen

source: {VAR_PLURAL, plural, zero {No Files} one {One File} other {{{filesPage.totalCount}} Files} }
de: {VAR_PLURAL, plural, zero {Keine Dateien} one {Eine Datei} other {{{filesPage.totalCount}} Dateien} }

# createConfigButton
source: Create Configuration
de: Konfiguration erstellen

# configSearchPlaceholder
source: Search name ...
de: Name suchen ...

# tableHeaderConfigVeraMode
source: VeraPDF Mode
de: VeraPDF Modus

# tableHeaderConfigCreation
source: Creation Date
de: Erstellt

source: {VAR_PLURAL, plural, one {Enabled} other {Disabled} }
de: {VAR_PLURAL, plural, one {Aktiviert} other {Deaktiviert}}

# modifyConfigButton
source: Modify
de: Bearbeiten

# deleteConfigButton
source: Delete
de: Löschen

source: {VAR_PLURAL, plural, =0 {No Configurations} =1 {One Configuration} other {{{this.configurationsPage.totalCount}} Configurations} }
de: {VAR_PLURAL, plural, =0 {Keine Konfigurationen} =1 {Eine Konfiguration} other {{{this.configurationsPage.totalCount}} Konfigurationen} }

# breadcrumbConfigurations
source: Configurations
de: Konfigurationen

# sectionGeneralSetup
source: General Setup
de: Allgemeines Setup

# sectionNameRules
source: File Name Rules
de: Dateinamensregeln

# sectionFitsResultRules
source: FITS Result Rules
de: FITS Regeln

# sectionVerapdfSetup
source: VeraPDF Configuration
de: VeraPDF Konfiguration

# headerConfigEditChanges
source: Unsaved changes ...
de: Nicht gespeicherte Änderungen

# sectionConfigEditGeneral
source: General
de: Allgemein

# labelConfigName
source: Configuration Name
de: Konfigurationsname

# configNamePlaceholder
source: Enter name ...
de: Name eingeben ...

# configNameHint
source: A short description for the configuration
de: Eine kurze Beschreibung der Konfiguration

# errorMessageNoConfigName
source: Please enter a name
de: Bitte Name eingeben

# labelConfigIdentifier
source: Configuration Identifier
de: Konfigurationsidentifier

# configIdentifierPlaceholder
source: Enter a identifier ...
de: Identifier eingeben ...

# configIdentifierHint
source: A unique identifier for the configuration used by submission clients
de: Ein eindeutiger identifier mit dem Clients die Konfiguration referenzieren können

# errorMessageNoUniqueIdentifier
source: Please enter a unique identifier
de: Bitte eindeutigen Identifier eingeben

# labelExecuteFits
source: Execute Fits
de: Fits ausführen

# fitsActivationHint
source: If active, FITS will be used to identify and validate file formats. Runs before veraPDF is executed.
de: Falls aktiv, so wird FITS zur Identifikation und Validierung von Dateiformaten ausgeführt. Läuft vor Ausführung von veraPDF.

# labelFitsTimeOut
source: Execution Time Out (Seconds)
de: Time Out (Sekunden)

# fitsTimeOutHint
source: The amount of seconds after which the validation process should be aborted.
de: Die Anzahl an Sekunden, nachdem der Validierungsprozess abgebrochen werden soll.

# labelVerapdfMode
source: Execution Mode
de: Ausführungsmodus

# labelVeraModeAlways
source: Run always (not recommended)
de: Immer ausführen

# labelVeraModeExtension
source: Run only when file has .pdf file extension
de: Nur ausführen, wenn Datei .pdf Dateiendung hat

# labelVeraModeFits
source: Run when a tool in FITS reports mime of type application/pdf
de: Ausführen, falls Tool in FITS den MIME Type application/pdf erkennt

# labelVeraModeDisabled
source: Disabled
de: Deaktiviert

# labelVerapdfTimeout
source: Execution Time Out (Seconds)
de: Time Out (Sekunden)

# hintVeraExecTimeout
source: The amount of seconds after which the validation process should be aborted.
de: Die Anzahl an Sekunden, nachdem der Validierungsprozess abgebrochen werden soll.

# labelVerapdfHeap
source: Max Heap Size (Megabyte)
de: Heapgröße (Megabyte)

# hintVerapdfHeap
source: The max heap size when executing veraPDF.
de: Die maximale Heapgröße bei der Ausführung von veraPDF.

# buttonConfigEditSave
source: Save changes
de: Änderungen speichern

# buttonConfigEditCancel
source: Cancel
de: Abbrechen

# addNameRuleButton
source: Add Rule
de: Regel hinzufügen

# deleteNameRuleButton
source: Delete
de: Löschen

# Label for rule value@@nameRuleValue
source: Value:
de: Wert:

# Label for rule outcome@@nameRuleOutcome
source: Outcome:
de: Ergebnis:

source: {VAR_PLURAL, plural, =0 {No Rules} =1 {1 Rule} other {{{fitsRulesPage.totalCount}} Rules } }
de: {VAR_PLURAL, plural, =0 {Keine Regeln} =1 {Eine Regel} other {{{fitsRulesPage.totalCount}} Regeln } }

# headerNameRuleditChanges
source: Unsaved changes ...
de: Nicht gespeicherte Änderungen ...

# nameRuleNameLabel
source: Rule Name
de: Regelname

# nameRuleNamePlaceholder
source: Enter name ...
de: Name eingeben ...

# nameRuleNameHint
source: A short description for the rule
de: Eine kurze Beschreibung der Regel.

# nameRuleNameError
source: Please enter a name
de: Bitte Name eingeben

# regexLabel
source: Regular Expression
de: Regulärer Ausdruck

# regexPlaceholder
source: Enter regular expression ...
de: Regulären Ausdruck eingeben ...

# regexHint
source: A regular expression with a syntax supported by the java pattern implementation
de: Ein regulärer Ausdruck mit Syntax, die von der Java Pattern Implementierung unterstützt wird.

# regexMissingError
source: Please enter a regular expression
de: Bitte regulären Ausdruck eingeben

# nameRuleOutcomeLabel
source: Outcome
de: Ergebnis

# nameTranslationsLegend
source: Error Message Translations
de: Übersetzungen für Fehlermeldungen

# nameRuleTranslationDescription
source: Error messages that will be shown to DSpace user
de: Bei Regelverstoß angezeigte Fehlermeldung.

# nameRuleTranslationMissing
source: Please enter a value
de: Bitte Wert eingeben

# buttonCreateNameRule
source: Create
de: Erstellen

# buttonSaveNameRulehanges
source: Save Changes
de: Änderungen speichern

# buttonCancelNameRuleChange
source: Cancel
de: Abbrechen

# addFitsRuleButton
source: Add Rule
de: Regel hinzufügen

# buttonDeleteFitsRule
source: Delete
de: Löschen

# Label for rule outcome@@fitsRuleOutcome
source: Outcome:
de: Ergebnis:

source: {VAR_PLURAL, plural, =0 {No Rules} =1 {1 Rule} other {{{fitsRulesPage.totalCount}} Rules } }
de: {VAR_PLURAL, plural, =0 {Keine Regeln} =1 {Eine Regel} other {{{fitsRulesPage.totalCount}} Regeln } }

# editFitsRuleLegend
source: Rule
de: Regel

# labelFitsRuleName
source: Rule Name
de: Regelname

# hintFitsRuleName
source: A short description for the rule
de: Eine kurze Beschreibung der Regel.

# errorMessageFitsRuleName
source: Please enter a name
de: Bitte Name eingeben

# labelFitsRuleTest
source: Test
de: Prüfbedingung

# placeholderFitsMime
source: Enter mime type ...
de: MIME Type eingeben ...

# errorMessageFitsNoMime
source: Please enter a mime type
de: Bitte MIME Type eingeben

# fitsTranslationsLegend
source: Error Message Translations
de: Übersetzungen für Fehlermeldungen

# fitsTranslationDescription
source: Error messages that will be shown to DSpace user
de: Bei Regelverstoß angezeigte Fehlermeldung.

# fitsRuleTranslationMissing
source: Please enter a value
de: Bitte Wert eingeben

# buttonCreateFitsRule
source: Create
de: Erstellen

# buttonSaveFitsRulehanges
source: Save Changes
de: Änderungen speichern

# buttonCancelFitsRuleChange
source: Cancel
de: Abbrechen

# headerVeraConfigChanges
source: Unsaved changes ...
de: Nicht gespeicherte Änderungen ...

# legendPdfAValidation
source: PDF/A Validation
de: PDF/A Validierung

# validationProfileLabel
source: Validation Profile
de: Validierungsprofil

# labelChecksThreshold
source: Failed Checks Threshold
de: Schwellwert für Regelverstöße

# hintChecksThreshold
source: Abort validation pre-maturely after specified number of failed checks.
de: Die Validierung wird nach o.g. Anzahl an Regelverstößen vorzeitig abgebrochen.

# labelLoggedViolations
source: Logged Violations per Rule
de: Aufgezeichnete Verstöße pro Regel

# hintLoggedViolations
source: How many check violations for a specific validation Rule should be logged.
de: Die Anzahl an Verstößen, die pro Regel mitgeloggt werden soll.

# enforcePdfAComplianceLabel
source: Enforce PDF/A Compliance
de: Nur valides PDF/A erlauben

# enforceComplianceHint
source: Invalidate file report if file is not valid PDF/A.
de: Dokument wird als Problem eingestuft, falls kein valides PDF/A.

# legendCustomPolicies
source: Custom PDF Policies
de: Benutzerdefinierte PDF-Validierungsregeln

# labelCustomPolicyCheckbox
source: Policy checks to apply on all pdf files. Most of these are redundant if you choose to enforce PDF/A compliance.
de: Policies, die auf alle PDF-Dateien angewendet werden. Die meisten dieser Regeln sind redundant, falls bereits auf valides PDF/A überprüft wird.

# labelDisallowEncryption
source: Disallow encryption (user password)
de: Kennwortschutz verbieten (Öffnen)

# labelDisallowTrailerEncryption
source: Disallow 'Encrypt' in PDF trailer dictionary (owner password)
de: Kennwortschutz verbieten (Berechtigungen / 'Encrypt' in Trailer)

# labelDisallowNoFonts
source: Disallow non-embedded fonts
de: PDF-Dateien mit nicht-eingebetteten Fonts verbieten

# labelDisallowFiles
source: Disallow embedded files
de: Dokumente mit eingebetteten Dateien verbieten

# labelDisallowFileAttachments
source: Disallow file attachments
de: Dokumente mit Dateianhängen verbieten

# labelDisallowMultimedia
source: Disallow multimedia (Annotations: Screen, Movie, Sound, 3D)
de: Dokumente mit Multimediainhalten verbieten (Screen, Movie, Sound, 3D)

# hintCustomPdfPolicies
source: Please note that encrypted PDFs will cause veraPDF execution to exit with an exception. If you are not enforcing PDF/A compliance you should check the disallow encryption policy. This will make sure that DSpace uploaders will see a corresponding error message (and not just some more generic 'call system staff' message).
de: Falls PDF/A-Konformität keine Rolle spielt, sollte die Regel zum Verbot von Dokumenten mit Kennwortschutz aktiviert sein. Hierdurch wird sichergestellt, dass dem DSpace Nutzer eine Fehlermeldung mit konkreter Problemstellung anstatt einer generischen 'Wenden Sie sich an den Betreiber' Nachricht angezeigt wird.

# buttonSaveVeraConfigChanges
source: Save changes
de: Änderungen speichern

# buttonCancelVeraConfigChanges
source: Cancel
de: Abbrechen

# selectValidationConfigButton
source: Select
de: Auswählen

# submitValidationButton
source: Create Batch Report
de: Stapelbericht erstellen

# sectionReportsScheduled
source: Scheduled Reports
de: Warteschlange

# sectionReportsCompleted
source: Completed Reports
de: Validierungsberichte

# batchColumnHeading
source: Batch
de: Stapel

# configurationColumnHeading
source: Configuration
de: Konfiguration

# statusColumnHeading
source: Processing Status
de: Bearbeitungsstatus

# finishedColumnHeading
source: Finished
de: Fertiggestellt

# resultColumnHeading
source: Result
de: Ergebnis

# deletedConfigurationPlaceholder
source: Deleted Configuration
de: Gelöschte Konfiguration

# outcomeValidationProblem
source: Problems
de: Probleme

# outcomeNoSummary
source: Problems
de: Probleme

# batchReportDeleteButton
source: Delete
de: Löschen

source: {VAR_PLURAL, plural, =0 {No Reports} =1 {One Report} other {{{this.finishedReportsPage.totalCount}} Reports} }
de: {VAR_PLURAL, plural, =0 {Keine Berichte} =1 {Ein Bericht} other {{{this.finishedReportsPage.totalCount}} Berichte} }

# submittedColumnHeading
source: Submitted
de: Übermittelt

# progressColumnHeading
source: Progress
de: Fortschritt

# placeholderWaiting
source: Waiting
de: Warten

# buttonCancelTask
source: Cancel
de: Abbrechen

source: {VAR_PLURAL, plural, =0 {No Scheduled Reports} =1 {One Scheduled Report} other {{{this.queuePage.totalCount}} Scheduled Reports} }
de: {VAR_PLURAL, plural, =0 {Keine Berichte} =1 {Ein Bericht} other {{{this.queuePage.totalCount}} Berichte} }

source: Batch Report
de: Stapelbericht

# deletedFilePLaceholder
source: Deleted File
de: Gelöschte Datei

# columnProblematicFiles
source: Problematic Files
de: Problematische Dateien

# headingFileValidationReports
source: File Reports
de: Dateiberichte

# fileColumnHeading
source: File
de: Datei

# fitsExecColumnHeading
source: FITS Execution
de: FITS Ausführung

# veraExecColumnHeading
source: VeraPDF Execution
de: VeraPDF Ausführung

# fileReportValid
source: Valid
de: Valide

# fileReportNotValid
source: Not Valid
de: Nicht valide

source: {VAR_PLURAL, plural, =0 {No Reports} =1 {One Report} other {{{this.fileReportsPage.totalCount}} Reports} }
de: {VAR_PLURAL, plural, =0 {Keine Berichte} =1 {Eine Bericht} other {{{this.fileReportsPage.totalCount}} Berichte} }

# fileReportProblemsSection
source: Identified Problems
de: Identifizierte Probleme

# columnHeadingValid
source: Valid
de: Validität

source: {VAR_PLURAL, plural, =0 {No Format Records} =1 {One Format Record} other {{{this.fileReport._embedded['fits-results'].length}} Format Records} }
de: {VAR_PLURAL, plural, =0 {Keine Formateinträge} =1 {Ein Formateintrag} other {{{this.fileReport._embedded['fits-results'].length}} Formateinträge} }

# verapdfExecutionColumnHeading
source: Execution Outcome
de: Ausführung

# verapdfProfileColumnHeading
source: Validation Profile
de: Validierungsprofil

# verapdfComplianceColumnHeading
source: Compliant
de: Validität

# verapdfPassedRulesColumnHeading
source: Passed Rules
de: Eingehaltene Regeln

# verapdfFailedRulesColumnHeading
source: Failed Rules
de: Nicht eingehaltene Regeln

# toolDidNotRunPlaceholder
source: Did Not Run
de: Nicht ausgeführt

# toolErrorPlaceholder
source: Failed
de: Fehler

# toolSuccessfulPlaceholder
source: Success
de: Erfolgreich

# failedChecksHeading
source: Failed Rule Checks
de: Fehlgeschlagene Regelprüfungen

# verapdfSpecification
source: Specification
de: Spezifikation

# verapdfClause
source: Clause
de: Klausel

# verapdfTestNumber
source: Test Number
de: Testnummer

# verapdfOccurences
source: Occurences
de: Vorkommnisse

# verapdfRuleDescription
source: Description:
de: Beschreibung:

# verapdfRuleObject
source: Object:
de: Objekt:

# verapdfRuleLocations
source: Locations:
de: Stellen:

# identifiedCheckType
source: Check Type
de: Regeltyp

# identifiedErrorMessage
source: Error Message
de: Fehlermeldung

# checkTypePlural
source: {check.checkType, select, fits {...} name {...} verapdf {...}}
de: {check.checkType, select, fits {...} verapdf {...}}

source: {VAR_PLURAL, plural, =0 {No Failed Checks} =1 {One Failed Check} other {{{this.checksPage.totalCount}} Failed Checks} }
de: {VAR_PLURAL, plural, =0 {Keine Regelverstöße} =1 {Ein Regelverstoß} other {{{this.checksPage.totalCount}} Regelverstöße} }

# settingsServiceSection
source: Service
de: Dienst

# settingsTranslationSection
source: VeraPDF Message Translations
de: VeraPDF Übersetzungen

# headerSettingsChanges
source: Unsaved changes ...
de: Ungespeicherte Änderungen

# labelParallelTasks
source: Parallel Tasks
de: Parallel verarbeitete Stapel

# hintParallelTasks
source: The numbert of batch reports to be processed at the same time.
de: Die Anzahl an Stapeln, die gleichzeitig validiert werden können.

# labelThreadsPerTask
source: Threads Per Task
de: Threads pro Stapel

# hintThreadsTask
source: The number of files to be validated in parallel during batch report validation.
de: Die Anzahl an Dateien, die gleichzeitig während der Stapelvalidierung untersucht werden sollen.

# labelAutoDeleteOldBatches
source: Automatically Delete Older Batches
de: Ältere Stapel automatisch löschen

# hintAutoDeleteOldBatches
source: If active, file batches (and associated reports) will be deleted after a specified amount of time.
de: Falls aktiv, so werden ältere Stapel und zugehörige Validierungsberichte automatisch gelöscht.

# labelBatchDeletionHours
source: Deletion Threshold (Hours)
de: Schwellwert für Löschung (Stunden)

# hintDeleteBatchAfterHours
source: Determines the amount of hours to wait after initial batch creation until the batch and all associated reports will be automatically deleted.
de: Legt fest, nach wie vielen Stunden ein Stapel automatisch gelöscht werden soll.

# labelApiPageSize
source: Page Size
de: Seitengröße

# hintApiPageSize
source: Size of collection pages delivered by REST API.
de: Größe der via REST API ausgelieferten Seiten für Collections.

# veraErrorMessageTranslations
source: Error Message Translations
de: Übersetzungen für Fehlernachrichten

# hintWhyMessageTranslations
source: Here you can define the messages that will be displayed if veraPDF identifies some problems.
de: Hier könnne Sie die Nachrichten definieren, die bei Verstoß gegen benutzerdefinierte PDF-Validierungsregeln angezeigt werden sollen.

# errorMessageValueMissing
source: Please enter a value
de: Bitte Wert eingeben

# buttonSaveSettingChanges
source: Save changes
de: Änderungen speichern

# buttonCancelSettingChanges
source: Cancel
de: Abbrechen

# authenticationHeading
source: Authentication
de: Anmelden

# userNameLabel
source: User
de: Benutzer

# userPasswordLabel
source: Password
de: Passwort

# loginPasswordPlaceholder
source: Password
de: Passwort

# loginSubmitButton
source: Submit
de: Übermitteln

# breadcrumbUsers
source: Users
de: Benutzer

source: {VAR_SELECT, select, 1 {Create User} other {Edit User} }
de: {VAR_SELECT, select, 1 {Benutzer erstellen} other {Benutzer bearbeiten} }

# userNamePlaceholder
source: Enter user name ...
de: Benutzername eingeben ...

# userNameHint
source: A name for the user
de: Der Anmeldename des Benutzers

# noUserNameMessage
source: Please enter a name
de: Bitte Name eingeben

# labelUserRole
source: Role
de: Rolle

# userRoleHint
source: Users can upload files and submit validation tasks. Only Admins may change configurations and settings.
de: User können Dateien hochladen und Stapelvalidierungen in Auftrag geben. Nur Admins können Konfigurationen und Einstellungen anpassen.

# userPasswordHint
source: A new login password
de: Ein neues Passwort

# userPasswordMessage
source: Please enter a password with a minimum length of 4 characters
de: Bitte Passwort mit mindestens 4 Zeichen eingeben

source: {VAR_SELECT, select, 1 {Create} other {Save Changes} }
de: {VAR_SELECT, select, 1 {Erstellen} other {Änderungen speichern} }

# buttonCancelChanges
source: Cancel
de: Abbrechen

# buttonNewUser
source: New User
de: Neuer Benutzer

# searchUserNamePlaceholder
source: Search name ...
de: Name suchen ...

# userRoleColumnHeading
source: Role
de: Rolle

# userCreationColumnHeading
source: Creation Date
de: Erstellt

# userModifiedColumnHeading
source: Last Modified
de: Geändert

# modifyUserButton
source: Modify
de: Bearbeiten

# userDeleteButton
source: Delete
de: Löschen

source: {VAR_PLURAL, plural, =0 {No Users} =1 {One User} other {{{this.usersPage.totalCount}} Users} }
de: {VAR_PLURAL, plural, =0 {Keine Benutzer} =1 {Ein Benutzer} other {{{this.usersPage.totalCount}} Benutzer} }
